# Exercícios de SQL
Essa série de exercícios tem como objetivo o treino da utilização da biblioteca sqlite3, que permite a utilização da sintaxe de SQL para realizar queries. \ A base de dados utilizada é a Brazilian E-Commerce Public Dataset by Olist, disponível publicamente no Kaggle. \ Sugerimos que, na medida do possível, utilize apenas queries em SQL, evitando a utilização de outras bibliotecas que nesta etapa do curso você já pode estar mais familiarizado(a). \ A exceção é a utilização do pandas quando for solicitada a visualização dos dados. \ Documentação da sqlite3

Link para a base de dados: https://drive.google.com/file/d/1qfyrOegq9jJXTvSIU2yzsQvOepQCHRte/view?usp=sharing. \ Aconselhamos a baixá-la para trabalhar localmente no Jupyter Notebook. Recomendamos também salvá-la na mesma pasta em que se encontra o arquivo do Jupyter.

# 1 - Importe a biblioteca necessária para realizar as queries em SQL, importe também o pandas para visualização dos dados.

In [1]:
# Importar Bibliotecas:
import pandas as pd

# Importar biblioteca SQLite com Python:
import sqlite3

# 2 - Realize a conexão com a base de dados 'olist_ecommerce.db' que se encontra na mesma pasta deste Notebook.
Nomeie essa variável como conn, pois vai ser utilzada com essa nomenclatura na célula abaixo.

In [3]:
conn = sqlite3.connect('olist_ecommerce.db')

In [ ]:
# Brazilian E-Commerce Public Dataset by Olist - Kaggle

olist_customers_dataset.csv
olist_geolocation_dataset.csv
olist_order_items_dataset.csv
olist_order_payments_dataset.csv
olist_order_reviews_dataset.csv
olist_orders_dataset.csv
olist_products_dataset.csv
olist_sellers_dataset.csv
olist_product_category_name_translation.csv

9 files

In [4]:

# Importante: como é possível observar no código abaixo, a função já retorna 
# os resultados da consulta como um DataFrame do pandas. 
# Além disso, o código abaixo restringe a exibição a apenas 7 linhas para os DataFrames criados. 
# Tal restrição é meramente estética e você pode alterá-la caso queira exibir mais linhas.


def consulta(query):
    cursor = conn.cursor()
    consult = cursor.execute(query)
    results = consult.fetchall()
    cols = [column[0] for column in consult.description]
    df = pd.DataFrame(results,columns=cols)
    cursor.close()
    return df

In [5]:
# Criamos a função auxiliar abaixo que permitirá que você se preocupe apenas 
# com a sintaxe de SQL, uma vez que o código em Python já está resolvido. 
# Para utilizá-la, basta inserir o código como um argumento da função 
# Ex:consulta('SEU CODIGO EM SQL')


def consulta(query):
    cursor = conn.cursor()
    consult = cursor.execute(query)
    results = consult.fetchall()
    cols = [column[0] for column in consult.description]
    df = pd.DataFrame(results,columns=cols)
    cursor.close()
    return df

In [6]:

pd.set_option("display.max_rows",7)

# 3 - Imprima na tela o nomes de todas as tabelas contidas na base de dados.

In [26]:

consulta("""SELECT name FROM sqlite_master WHERE type='table';""")

                                 name
0             olist_customers_dataset
1           olist_geolocation_dataset
2           olist_order_items_dataset
..                                ...
5                olist_orders_dataset
6              olist_products_dataset
7   product_category_name_translation

[8 rows x 1 columns]

# 4 - Descubra informações da tabela 'olist_orders_dataset' como os nomes das colunas, os tipos de dados em cada uma delas, etc.

In [8]:


consulta('pragma table_info(olist_orders_dataset)')

    cid                           name  type  notnull dflt_value  pk
0     0                       order_id  TEXT        0       None   0
1     1                    customer_id  TEXT        0       None   0
2     2                   order_status  TEXT        0       None   0
..  ...                            ...   ...      ...        ...  ..
5     5   order_delivered_carrier_date  TEXT        0       None   0
6     6  order_delivered_customer_date  TEXT        0       None   0
7     7  order_estimated_delivery_date  TEXT        0       None   0

[8 rows x 6 columns]

# 5 - Selecione todos os dados da tabela 'olist_order_reviews_dataset'

In [27]:


consulta("""SELECT * FROM olist_order_reviews_dataset""")

,review_id,order_id,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp
0,7bc2406110b926393aa56f80a40eba40,73fc7af87114b39712e6da79b0a377eb,4,None,None,2018-01-18 00:00:00,2018-01-18 21:46:59
1,80e641a11e56f04c1ad469d5645fdfde,a548910a1c6147796b98fdf73dbeba33,5,None,None,2018-03-10 00:00:00,2018-03-11 03:05:13
2,228ce5500dc1d8e020d8d1322874b6f0,f9e4b658b201a9f2ecdecbb34bed034b,5,None,None,2018-02-17 00:00:00,2018-02-18 14:36:24
...,...,...,...,...,...,...,...
99997,1adeb9d84d72fe4e337617733eb85149,7725825d039fc1f0ceb7635e3f7d9206,4,None,None,2018-07-01 00:00:00,2018-07-02 12:59:13
99998,be360f18f5df1e0541061c87021e6d93,f8bd3f2000c28c5342fedeb5e50f2e75,1,None,Solicitei a compra de uma capa de retrovisor c...,2017-12-15 00:00:00,2017-12-16 01:29:43
99999,efe49f1d6f951dd88b51e6ccd4cc548f,90531360ecb1eec2a1fbb265a0db0508,1,None,"meu produto chegou e ja tenho que devolver, po...",2017-07-03 00:00:00,2017-07-03 21:01:49

# 6 - Selecione todos os dados da tabela 'olist_order_reviews_dataset' que tenham 
# o score igual a 5

In [28]:


consulta("""SELECT * FROM olist_order_reviews_dataset
             WHERE review_score=5 
            """)

,review_id,order_id,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp
0,80e641a11e56f04c1ad469d5645fdfde,a548910a1c6147796b98fdf73dbeba33,5,None,None,2018-03-10 00:00:00,2018-03-11 03:05:13
1,228ce5500dc1d8e020d8d1322874b6f0,f9e4b658b201a9f2ecdecbb34bed034b,5,None,None,2018-02-17 00:00:00,2018-02-18 14:36:24
2,e64fb393e7b32834bb789ff8bb30750e,658677c97b385a9be170737859d3511b,5,None,Recebi bem antes do prazo estipulado.,2017-04-21 00:00:00,2017-04-21 22:02:06
...,...,...,...,...,...,...,...
57417,574ed12dd733e5fa530cfd4bbf39d7c9,2a8c23fee101d4d5662fa670396eb8da,5,None,None,2018-07-07 00:00:00,2018-07-14 17:18:30
57418,f3897127253a9592a73be9bdfdf4ed7a,22ec9f0669f784db00fa86d035cf8602,5,None,None,2017-12-09 00:00:00,2017-12-11 20:06:42
57419,b3de70c89b1510c4cd3d0649fd302472,55d4004744368f5571d1f590031933e4,5,None,"Excelente mochila, entrega super rápida. Super...",2018-03-22 00:00:00,2018-03-23 09:10:43

# 7 - Selecione todos os pagamentos da 'olist_order_payments_dataset' que foram realizados
# com cartão de crédito e possuem um valor acima de R$500.

In [30]:

consulta('''SELECT * FROM olist_order_payments_dataset 
             WHERE payment_value > 500 
             AND payment_type = "credit_card"''')

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,d0a945f85ba1074b60aac97ade7e240e,1,credit_card,2,541.00
1,2e2c60b99754ae1e4d8b18846cfec9f2,1,credit_card,4,542.66
2,110d9355d6338eab0a65a0cacdde5434,1,credit_card,5,566.40
...,...,...,...,...,...
3485,4198c92e06d92792e49f119f659e723e,1,credit_card,10,1294.26
3486,0f121110b75ef7c38c79d67833c49830,1,credit_card,10,956.86
3487,df8ab61cb615d551483618533aceb364,1,credit_card,10,713.65

# 8 - Selecione os 5 valores mais altos transacionados por cartão de crédito da 'olist_order_payments_dataset' e oredene-os de forma decrescente.

In [31]:

consulta("""SELECT payment_value FROM olist_order_payments_dataset 
            WHERE payment_type = "credit_card"
            ORDER BY payment_value DESC
            LIMIT 5""")

   payment_value
0       13664.08
1        6929.31
2        4950.34
3        4809.44
4        4764.34

# 9 - Selecione as cidades e os estados responsáveis pelos 10 valores mais altos da 'olist_order_payments_dataset'. Se quiser, mostre também os valores transacionados.

In [32]:

consulta("""SELECT p.payment_value, c.customer_city, c.customer_state
        FROM olist_order_payments_dataset p 
        INNER JOIN olist_orders_dataset o 
        ON o.order_id = p.order_id
        INNER JOIN olist_customers_dataset c
        ON c.customer_id = o.customer_id
        ORDER BY p.payment_value DESC
        LIMIT 10 """)

    payment_value   customer_city customer_state
0        13664.08  rio de janeiro             RJ
1         7274.88      vila velha             ES
2         6929.31    campo grande             MS
..            ...             ...            ...
7         4809.44         goiania             GO
8         4764.34            maua             SP
9         4681.78     joao pessoa             PB

[10 rows x 3 columns]

# 10 - Faça um agrupamento que mostre os estados que mais gastaram de acordo com a presente base de dados e disponha-os na tela em ordem decrescente de acordo com seus gastos.

In [33]:

consulta("""SELECT SUM(p.payment_value) AS payment_value, c.customer_state AS state
        FROM olist_order_payments_dataset p 
        INNER JOIN olist_orders_dataset o 
        ON o.order_id = p.order_id
        INNER JOIN olist_customers_dataset c
        ON c.customer_id = o.customer_id
        GROUP BY c.customer_state
        ORDER BY 1 DESC
        """)

    payment_value state
0      5998226.96    SP
1      2144379.69    RJ
2      1872257.26    MG
..            ...   ...
24       19680.62    AC
25       16262.80    AP
26       10064.62    RR

[27 rows x 2 columns]